#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.KEYCLOAK_PROD.module.moh_applications.module.HDPBC.keycloak_openid_client.CLIENT has changed
  ~ resource "keycloak_openid_client" "CLIENT" {
      + extra_config                               = {}
        id                                         = "79072611-84fa-4477-9370-7a7630fdd5e7"
        name                                       = "HDPBC"
      + web_origins                                = []
        # (23 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.DMFT-SERVICE.keycloak_openid_client.CLIENT will be updated in-place
  ~ resource "keycloak_openid_client" "CLIENT" {
      ~ client_id                                  = "DMFT-SERVICE-ACCOUNT" -> "DMFT-SERVICE"
        id                                         = "2fa5ed3f-39bd-4f67-84be-b1053bec576e"
        name                                       = "DMFT"
        # (24 unchanged attributes hidden)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PRP-SYSTEM.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_token_lifespan                     = "28800"
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "prp_system"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "The Provider and Location Registry (PLR) is a standards-based repository of core provider data supplied by authorized sources, and available to authorized consumers, that facilitates the formal exchange of health information."
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PRP-SYSTEM.keycloak_openid_hardcoded_claim_protocol_mapper.orgId will be created
  + resource "keycloak_openid_hardcoded_claim_protocol_mapper" "orgId" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + add_to_userinfo     = true
      + claim_name          = "orgId"
      + claim_value         = "00002855"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "orgId"
      + realm_id            = "moh_applications"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-dmft-service"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "view-client-dmft-service"
      + service_account_user_id = "9ab20ecc-c39f-45d4-992c-8290579a247d"
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-dmft-service"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "2ddc7173-34f3-41ff-9beb-66c7802717ce"
      + id        = (known after apply)
      + name      = "view-client-dmft-service"
      + realm_id  = "moh_applications"
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @nathanielcx, Action: `pull_request`*